export const order = [{
  "email": "elice@hello.com",
  "shipingStatus": "상품 준비중",
  "deliveryFee": "3000",
  "userName": "김토끼",
  "postalCode": "13536",
  "address": "경기 성남시 분당구 판교역로10번길 16  (백현동)",
  "detailAddress": "1동",
  "userPhone": "123-3434-5346",
  "orderRequest": "11",
  "orderList": [
    {
      "product": {
          "_id": {
            "$oid": "6446b858a5a770787eea5b2d"
          },
          "title": "빠른 모바일 앱 개발을 위한 React Native 리액트 네이티브 2/E",
          "author": "바니 아이젠먼",
          "publisher": "인사이트",
          "publication_date": "2018-08-07T15:00:00.000Z",
          "isbn": "9788966262250",
          "description": "iOS와 안드로이드에서 동작하는 모바일 앱을 만드는 법을 소개한다. 자바스크립트와 리액트를 활용하여 iOS 및 안드로이드에서 동작하고 진짜 네이티브로 렌더링되는 모바일 애플리케이션을, 기능적인 제약 없이 만들고 배포할 수 있게 도와준다.\n\n카메라와 사용자 위치, 로컬 저장소 등 플랫폼에서 제공하는 기능을 리액트 네이티브에서 사용하는 방법, 인터페이스를 만들고 꾸미는 방법, 모바일 컴포넌트를 사용하는 방법, 디버깅을 위한 도구와 배포하는 방법 등을 예제 코드를 보여주면서 설명하고 있어 단계적으로 배울 수 있다. 서드파티 라이브러리나 자바, 오브젝티브-C 라이브러리를 활용하여 리액트 네이티브를 확장하는 방법도 다루고 있다.",
          "price": 24000,
          "image_path": "../product-images/9788966262250.png",
          "category": "모바일 앱 개발"
      },
      "amount": "3"
    }, 
    {
      "product": {
        "_id": {
          "$oid": "6446b858a5a770787eea5b2e"
        },
        "title": "린 모바일 앱 개발",
        "author": "애덤 데니스",
        "publisher": "에이콘출판",
        "publication_date": "2019-05-23T15:00:00.000Z",
        "isbn": "9791161752921",
        "description": "린 스타트업 기법을 모바일 앱 개발에 적용해서 구글 플레이나 앱 스토어에서 돌풍을 일으킬 만한 앱을 좀 더 쉽게 개발할 수 있는 방법을 제시한다. 또한 사업을 전개하는 과정과 기술 노하우를 현명하게 통합하는 방법도 알려준다.\n\n저자가 실제로 만들었던 모바일 앱을 예제로 해 린 기법을 안드로이드 및 iOS에 적용하고, 최소기능제품을 만들고, 비즈니스 모델 캔버스로 아이디어를 검증하며 통계와 댓글로 피드백을 모으고, 비즈니스 요구 사항에 유연하게 대응하며, 전환율을 높여 성공적인 앱을 개발하는 방법을 알아본다.",
        "price": 35000,
        "image_path": "../product-images/9791161752921.png",
        "category": "모바일 앱 개발"
      },
      "amount": "1"
    }
  ],
  "totalPrice": "107000",
  "orderId": "LD86564649"
}];