const bookList = [
    {
      title: '이것이 자료구조+알고리즘이다 with C 언어',
      author: '박상현',
      publisher: '한빛미디어',
      publication_date: new Date(2022, 7, 3),
      isbn: '9791169210034',
      description: `자료구조와 알고리즘은 IT 기업의 면접과 코딩 테스트 통과를 위한 필수 역량입니다. 알고리즘을 배워두면 단순히 취업뿐 아니라 더 좋은 개발자가 되는 데 큰 도움이 됩니다. 하지만 자료구조와 알고리즘은 배우기 어려우며 심지어 재미도 없다 보니 많은 개발자가 중도에 학습을 포기합니다. 『이것이 자료구조+알고리즘이다』는 독자가 마지막 페이지까지 읽도록 하는 것에 목표를 두었습니다.
      처음 배우는 사람의 눈높이에 맞춰 리스트부터 백트래킹까지 자주 사용되는 자료구조와 알고리즘 개념을 위트 넘치는 이야기로 쉽게 설명합니다. 보기만 해도 헉 소리가 나는 복잡한 수식은 최소화하고 이해에 꼭 필요한 수식만 담았습니다. 또한 작동 원리를 단번에 이해할 수 있게 도와주는 다양한 그림과 바로 실행하고 확인할 수 있는 108개 소스 코드를 예제로 제공해 알고리즘의 얼개를 완벽히 이해할 수 있도록 구성했습니다.
      『이것이 자료구조+알고리즘이다』와 함께 자료구조와 알고리즘의 주요 개념을 포기 없이 끝까지 배워봅시다!`,
      price: 30600,
      image_path: '../product-images/9791169210034.png',
      category: '알고리즘·자료구조',
    },
    {
      title: '누구나 자료 구조와 알고리즘',
      author: '제이 웬그로우',
      publisher: '길벗',
      publication_date: new Date(2021, 10, 30),
      isbn: '9791165217815',
      description: `사칙 연산으로 복잡한 알고리즘을 쉽게 이해해보자

      수학 용어와 전문 용어가 아니어도 이해한다
      이 분야의 책은 대부분 컴퓨터 공학 전공자를 대상으로 쓰였거나 고등학교 수학을 잘 안다고 가정하고 있다. 쉽게 설명했다는 책도 전문 용어로 가득하다. 비전공자나 수학적 기초가 약한 독자는 전문 용어에 두려움을 느끼며 이 주제를 이해할 만큼 자신이 똑똑하지 않다고 느끼며 이 주제를 회피한다. 그러나 자료 구조와 알고리즘은 대부분 상식선에서 이해할 수 있다. 엄밀한 수학적 분석이 아니어도 직관으로 이해할 수 있는 범위에서 상식이 통하는 설명으로 자료 구조와 알고리즘을 이해해보자.
      
      프로그래밍의 핵심 스킬을 이해한다
      자료 구조와 알고리즘은 프로그래밍의 핵심 스킬이다. 더 빠른 코드, 더 효율적인 코드를 작성하려면 반드시 알아야 하는 사고 방식이 자료 구조와 알고리즘에 담겨 있다. 추상적인 개념만 설명하는 대신 실생활에서 마주할 수 있는 상황을 제시하며 자료 구조와 알고리즘을 적용하는 방법을 보여준다. 자료 구조와 알고리즘은 개념만 이해하면 어떤 언어로도 구현할 수 있다는 것도 보여준다. 이 책에서는 자바스크립트, 루비, 파이썬으로 된 예제를 제시한다.
      
      자료 구조와 알고리즘을 선택하는 방법을 배운다
      전공 교재는 자료 구조와 알고리즘을 암기하고 시험만 볼 뿐이다. 입사 면접에서는 어떤 문제를 두고 배열, 연결 리스트, 해시 중에 무엇을 선택해야 하는지, 왜 그게 최적의 방법인지 묻는다. 자료 구조를 선택하는 방법, 선택한 자료 구조가 코드의 성능에 어떤 영향을 미치는지 설명하므로 암기된 단편적인 지식이 아닌 연결된 지식을 가르치고, 입사 면접을 준비할 때도 참고할 수 있게 했다.
      
      2판에서 달라진 점
      코딩 테스트에 출제 빈도가 높은 다이나믹 프로그래밍, 트라이(Trie)에 대한 내용을 추가로 담았다. 재귀를 사용한 재귀적 반복과 속도를 높이는 재귀 알고리즘에 더해 재귀 알고리즘을 작성하는 방법에서는 문제의 유형에 따라 재귀 알고리즘을 작성하는 방법을 장으로 추가하고 자세한 전략을 담았다. 코딩 면접에서 자주 묻는 구현 알고리즘 개선 문제에 대한 항목을 최적화 주제로 보강했고, 각 장에는 더 연습할 수 있는 문제를 추가로 수록했다.`,
      price: 29700,
      image_path: '../product-images/9791165217815.png',
      category: '알고리즘·자료구조',
    },
    {
      title: '자바스크립트로 하는 자료 구조와 알고리즘',
      author: '배세민',
      publisher: '에이콘출판',
      publication_date: new Date(2019, 7, 30),
      isbn: '9791161753447',
      description: `
      자료 구조와 알고리즘의 개념을 이해하고 이를 자바스크립트로 구현하기 위한 책이다. 자바스크립트 프로그래머라면 제대로 된 애플리케이션을 만들기 위해 알아야 할 핵심 자료 구조와 알고리즘을 다룬다. 해시 테이블, 연결 리스트, 큐, 트리, 그래프 등의 핵심 자료 구조와 검색, 정렬, 재귀, 동적 프로그래밍, 비트 연산 등의 핵심 알고리즘을 배우고 이를 실제 자바스크립트로 구현해본다. 이러한 과정을 통해 자료 구조와 알고리즘에 대한 이해도를 높일 수 있을 뿐만 아니라 자바스크립트 구현 능력도 키울 수 있다.
      `,
      price: 27000,
      image_path: '../product-images/9791161753447.png',
      category: '알고리즘·자료구조',
    },
    {
      title: 'Do it! 자료구조와 함께 배우는 알고리즘 입문: 자바 편',
      author: '시바타 보요',
      publisher: '이지스퍼블리싱',
      publication_date: new Date(2022, 3, 25),
      isbn: '9791163033486',
      description: `
      자료구조와 알고리즘은 국내외 IT 기업의 면접과 코딩 테스트에서 중요한 역량입니다. 이는 단순히 개념만 이해한다고 해서 바로 실전에 사용하기가 힘듭니다. 하나하나 자신의 손으로 코딩하고 결과를 확인해 보면서 컴퓨터가 어떻게 데이터를 저장하고 문제를 해결하는지 직접 경험해야 실전에서도 막힘없이 사용할 수 있습니다.
      새롭게 단장한 『Do it! 자료구조와 함께 배우는 알고리즘 입문 - 자바 편(전면 개정판)』은 전편보다 풍부한 도해와 예제로 개념을 더욱 쉽게 이해할 수 있도록 구성했습니다. 또한 최신 버전인 자바 14를 반영하여 실무에 도움이 되는 예제들을 추가했습니다. 엄선한 102개의 실습 예제, 84개의 연습 문제를 직접 코딩하다 보면 자바 프로그래밍 실력까지 더 높일 수 있습니다.
      `,
      price: 19800,
      image_path: '../product-images/9791163033486.png',
      category: '알고리즘·자료구조',
    },
    {
      title: 'Do it! 자료구조와 함께 배우는 알고리즘 입문: 자바 편',
      author: '김현숙, 황숙희',
      publisher: '길벗캠퍼스',
      publication_date: new Date(2023, 0, 10),
      isbn: '9791140702688',
      description: `
      컴퓨터가 데이터를 저장하고 문제를 해결하는 기초인 자료구조를 쉽게 이해할 수 있도록 자료형, 자료구조, 알고리즘에 대한 기본 정의와 비교에 대한 설명을 포함하고 있다. 이해를 돕는 다양한 그림과 도해와 함께 폭넓은 실습 예제를 제공한다. 지금까지 알려진 자료구조를 실제 데이터에 적용하여 문제를 해결 방법을 파이썬 예제를 통해서 학습할 수 있습니다.

      이 책의 장점을 알려주는 3단계 학습 구조
      Step 1 자료구조와 알고리즘을 그림과 도해로 이해
      Step 2 다양한 문제 해결 방식과 알고리즘 학습 방법 제시
      Step 3 파이썬 실습 예제를 통해 자료구조와 알고리즘 구현
      `,
      price: 28000,
      image_path: '../product-images/9791140702688.png',
      category: '알고리즘·자료구조',
    },
    {
      title: '문제 해결력을 높이는 알고리즘과 자료 구조',
      author: '오츠키 켄스케',
      publisher: '길벗',
      publication_date: new Date(2022, 1, 22),
      isbn: '9791165218874',
      description: `
      이 책은 알고리즘 입문서이자 + 응용력, 문제 해결력을 높여주는 알고리즘 활용서다. 궁극적으로 알고리즘을 잘 다룰 수 있게 실력을 키우는 것을 목표로 한다. 우선 알고리즘에 대해 전혀 모르는 사람이 알고리즘의 전반적인 모습을 체계적으로 인식하고, 필요한 기초 개념과 기본적인 알고리즘을 배울 수 있다. 알고리즘을 설명할 때는 유명한 알고리즘을 단순히 소개하는 것이 아니라 어떻게 설계되었는지 설계 기법과 설계 과정, 응용 방법과 사례도 함께 설명한다. 또한, 다양한 상황에서 알고리즘을 사용해 문제를 해결할 수 있도록 알고리즘을 설계할 때 필요한 지식과 접근법을 설명한다. 목표는 알고리즘의 동작을 구체적으로 이해하고 실제 문제 해결에 사용하는 것이며, 알고리즘을 단순히 아는 것을 넘어서 잘 다루는 것이다. 우리는 알고리즘을 사용해 주어진 문제를 잘 풀기도 하고, 내가 직접 설계도 하고, 더 효율적으로 개선할 수도 있어야 한다. 이 책은 이를 위해 필요한 방법과 지식을 학습한다.
      `,
      price: 21600,
      image_path: '../product-images/9791165218874.png',
      category: '알고리즘·자료구조',
    },
    {
      title: '데이터베이스 신뢰성 엔지니어링',
      author: '레인 캠벨, 채리티 메이저스',
      publisher: '에이콘출판',
      publication_date: new Date(2023, 1, 28),
      isbn: '9791161757261',
      description: `
      과거 DBA의 역할이 DBRE(DataBase Reliability Engineering)라는 새로운 패러다임을 만나게 되면서 그 역할이 어떻게 변해야 하는지 설명한다. 먼저 DBRE의 개념을 소개하고 백업, 복구, 복제, 인덱스, 모니터링과 같은 데이터베이스 관리의 기초 영역에서부터 스토리지, 보안, 데이터 스토어 등 인프라 관점에서 데이터베이스 관리자의 역할을 살펴본다. 그리고 서비스 및 아키텍처 관점에서 서비스 수준 요구 사항, 위험 평가 관리, 배포 관리, 분산 데이터베이스 설계를 알아보고 마지막으로 DBRE 문화를 형성하는 방법과 DBA에서 DBRE의 역할로 전환할 수 있는 다양한 방법을 살펴본다.
      `,
      price: 31500,
      image_path: '../product-images/9791161757261.png',
      category: '데이터베이스',
    },
    {
      title: '데이터베이스 인터널스',
      author: '알렉스 페트로프',
      publisher: '에이콘출판',
      publication_date: new Date(2023, 1, 28),
      isbn: '9791161754963',
      description: `
      데이터베이스에 데이터를 저장하는 방식과 분산 시스템의 일관성을 유지할 때 사용되는 개념과 알고리즘을 설명한다. 나아가 이들을 개선하기 위해 등장한 여러 새로운 알고리즘도 설명한다. 최신 분산 시스템과 논문에서 찾아볼 수 있는 개념들과 관련 문헌을 정리한 이 책을 통해 데이터베이스에 어떤 고질적인 문제가 있는지, 이들을 어떻게 해결할 수 있으며 또 어떤 새로운 연구들이 진행되고 있는지 배우게 될 것이다.
      `,
      price: 31500,
      image_path: '../product-images/9791161754963.png',
      category: '데이터베이스',
    },
    {
      title: 'SQL과 NoSQL데이터베이스 입문',
      author: '박성진',
      publisher: '생능',
      publication_date: new Date(2023, 1, 24),
      isbn: '9791192932002',
      description: `
      기존 데이터베이스 교재들은 데이터베이스의 핵심 원리와 기술을 학습하기 위한 이론서와 DBMS 실습을 중심으로 데이터베이스 활용 능력을 위한 실무서 2종류로 크게 분류할 수 있다. 물론 이러한 교재들은 데이터베이스를 체계적으로 연구하거나 현업에서 활용할 수 있는 심화된 실무 능력을 갖추고자 하는 학습자에게는 데이터베이스 전문 지식의 깊이를 더할 수 있는 기회를 제공할 것이다.

      하지만 학부 수준에서 한 학기 정도의 시간 투자만으로 데이터베이스 핵심 개념과 기초적인 활용 방법을 학습하고자 하는 데이터베이스 입문자에게는 적절한 선택이 되지 못한다. 특히, 데이터베이스가 더 이상 IT 관련 전공자들의 전유물이 아니며 다양한 이공계 전공자, 여러 인문·사회 계열의 융합 전공에서도 데이터베이스가 필수 지식으로 인식되고 있는 현 시점에서는 더더욱 그러하다.

      또 최근에는 데이터 저장과 관리뿐만 아니라 데이터 분석과 활용에, 또 정형 데이터뿐만 아니라 비정형 데이터, 대용량 데이터에 보다 많은 관심이 집중되고 있다. SQL 기반의 전통적 데이터베이스뿐만 아니라 데이터웨어하우스, 빅데이터 그리고 몽고DB와 같은 NoSQL 데이터베이스에 대한 기본적인 학습 필요성이 증가하고 있으나 이를 위한 교재는 드문게 현실이다.

      이 책은 책 한 권으로 데이터베이스를 처음 접하는 일반 사용자나 개발자, IT 융합에 관심을 갖는 다양한 전공자들 누구나 쉽게 SQL과 NoSQL 데이터베이스의 기본 개념과 구조를 이해하고 데이터베이스를 설계, 구축하고 활용해볼 수 있도록 구성하였다. 꼭 필요한 핵심 개념을 모두 포함하면서도 예제나 그림을 사용하여 쉽게 설명하고자 노력하였다. 또한, 정작 실무에서는 매우 중요함에도 기존 교재에서는 소홀히 다루었던 데이터베이스 설계 방법을 적절한 예제를 통해 경험할 수 있도록 구성하였다. 핵심만 간추린 개념과 다양한 예제를 통한 간결한 설명, 그리고 이를 적용한 MySQL 활용 예제를 적용하고 실습하다보면 초보자라도 빠르게 준전문가가 될 수 있을 것이다.

      이 책은 실제 적용할 수 있는 다양한 구체적 예제를 통해 데이터베이스 활용 능력을 충분히 습득할 수 있도록 구성했으며 빅데이터를 포함한 최신 데이터베이스 기술에 대한 충분한 소개와 설명도 제공한다. 실습 예제도 이해를 돕는 간단한 예제 수준의 코드에 그치지 않고 실제 활용 가능한 소규모의 모바일 웹 프로젝트 코드도 제공하였다. 각 장의 연습 문제도 각종 자격증과 공무원, 인증 시험 문제에 대비한 모의고사 문제를 포함하고 있어 각종 자격시험과 채용시험을 준비하는데 도움이 될 것이다.
      `,
      price: 27000,
      image_path: '../product-images/9791192932002.png',
      category: '데이터베이스',
    },
    {
      title: '오라클로 배우는 데이터베이스 개론과 실습',
      author: '박우창, 남송휘, 이현룡',
      publisher: '한빛아카데미',
      publication_date: new Date(2020, 6, 30),
      isbn: '9791156645023',
      description: `
      데이터베이스 핵심 이론을 오라클로 실습하며 공부할 수 있는 책입니다. 데이터베이스 시스템을 이해하는 데 필요한 이론을 4개의 부로 나누어 실습과 함께 익힌 다음, 마지막에는 워크북으로 배운 내용을 총정리합니다. 사례 중심의 체계적인 이론과 실습을 한 번에 학습함으로써 데이터베이스 전문가로 거듭날 수 있도록 기본기를 다져줍니다.

      ※ 본 도서는 대학 강의용 교재로 개발되었으므로 연습문제 해답은 제공하지 않습니다
      `,
      price: 29000,
      image_path: '../product-images/9791156645023.png',
      category: '데이터베이스',
    },
    {
      title: 'MySQL과 모바일 웹으로 만나는 데이터베이스의 정석',
      author: '박성진',
      publisher: '배움터',
      publication_date: new Date(2019, 7, 22),
      isbn: '9788989383789',
      description: `
      이 책은 책 한 권으로 데이터베이스를 처음 접하는 일반 사용자나 개발자, IT 융합에 관심을 갖는 다양한 전공자들 누구나 쉽게 데이터베이스의 기본 개념과 구조를 이해하고 데이터베이스를 설계, 구축하고 활용해볼 수 있도록 구성하였다. 꼭 필요한 핵심 개념을 모두 포함하면서도 예제나 그림을 사용하여 쉽게 설명하고자 노력하였다.

      또한, 정작 실무에서는 매우 중요함에도 기존 교재에서는 소홀히 다루었던 데이터베이스 설계 방법을 적절한 예제를 통해 경험할 수 있도록 구성하였다. 핵심만 간추린 개념과 다양한 예제를 통한 간결한 설명, 그리고 이를 적용한 MySQL 활용 예제를 적용하고 실습하다보면 초보자라도 빠르게 준전문가가 될 수 있을 것이다.

      이 책은 핵심 데이터베이스 기술에 대한 소개와 설명에 그치지 않고 실제 적용할 수 있는 다양한 구체적 예제를 통해 데이터베이스 활용 능력을 충분히 습득할 수 있도록 구성하였다. 이해를 돕는 간단한 예제 수준의 코드에 그치지 않고 실제 활용 가능한 소규모의 모바일 웹 프로젝트 코드도 제공하였다. 각 장의 연습 문제도 각종 자격증과 공무원, 인증 시험 문제에 대비한 모의고사 문제를 포함하고 있어 각종 자격시험과 채용시험을 준비하는데 도움이 될 것이다.
      `,
      price: 19000,
      image_path: '../product-images/9788989383789.png',
      category: '데이터베이스',
    },

  ];

  console.log(JSON.stringify(bookList));